// 04Var00.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int main()
{
    // 코드는
    // exe파일이 되는것이니까 exe파일에서는
    // 공격력을 만들고 100을 집어 넣어야 한다~

    // f5를 누르고 main의 실행흐름이 만들어지면
    // 진짜 공격력이 만들어지고 거기에 100이 들어가게 됩니다.

    // 100을 상수라고 합니다.
    // 프로그램이 동작하면서 절대 바뀌지 않는 값을 의미
    // exe파일에 새겨진값이라고 생각

    // =0이 초기화라고 부르고
    // 그중에서도 리터럴 초기화라고 합니다.
    // int => 정수
    //Att => 그 정수에 Att라는 이름을 붙여라
    // = => 내 오른쪽에 있는 값을 집어 넣어라
    // 100 => 상수 => exe파일에 새겨져 있는 값
    // 상수란 f5를 누르고 실행되고 난후에는
    // 바꿀수 없는 값들을 상수값이라고 합니다.

    // ; 앞으로 만힝 보게 될건데
    // 일단 여기까지 실행해라
    // 실행 흐름을 ;가 나온곳까지 딱 끝내줘
    // 그리고 나서 다음거 실행해줘
    
    // int Att

    // AttTest; 

    int Att = 100;

    // 1. 4바이트 메모리를 할당
    // 2. 이름과 순서는 Att 091262번째 바이트에
    // 3. 메모리가 만들어지면 집어 넣어라
    // 4. 코드영역 존재하는 90dcu93812번째 바이트의
    // 5. 4바이트 메모리 영역에 있는 값을
    //
}


