// 주석이라고 한다. <= 코드에 인간이 알아보기 쉬운글자로 적힌 정보를 넣기 위한 전처리문법
// 컴퓨터에서는 주석을 인식할 필요가 없어서 인식하지않음

// <= 존재 자체가 사람들끼리 보기 위함이라 주석이라는 문법은 메모리에 아무런 영향을 주지않는 문법

// 컴파일 과정
// 전처리기 => 컴파일러 => 어셈블러 => 링커

// 전처리기가 하는일
// 1. 주석삭제
// 2. 

// 전처리문
// #include < 파밀명 > 
#include <iostream>

// main함수
int main()
{
    // 첫번째
    // 순수한 상태에서 평범한 수준의 지식을 가진 프로그래머는 아무것도 하지 못함
    
    // 코드의 지식은 계속 쌓여 나갔다. 
    // 맨처음부터 다시 짠다면 콘솔창을 어떻게 띄울까?
    // 전기신호를 어떻게 받을까?
    // 어떻게? 왜? 저런짓부터 안해도 되지?

    // 검은색 콘솔창에 aaaa bbb띄어라.
    //printf_s("aaaa bbb");
}

